templates/invoice/version-1-0-0/get-invoices.xml

<?xml version='1.0' encoding='utf-8'?>
<soap-env:Envelope xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/">
    <soap-env:Body>
        <ns0:GetInvoicesRequest xmlns:ns0="http://www.promostandards.org/WSDL/Invoice/1.0.0/">
            <ns1:wsVersion xmlns:ns1="http://www.promostandards.org/WSDL/Invoice/1.0.0/SharedObjects/">{{wsVersion}}
            </ns1:wsVersion>
            <ns2:id xmlns:ns2="http://www.promostandards.org/WSDL/Invoice/1.0.0/SharedObjects/">{{username}}</ns2:id>
            <ns3:password xmlns:ns3="http://www.promostandards.org/WSDL/Invoice/1.0.0/SharedObjects/">
                {{password}}
            </ns3:password>
            <ns4:queryType xmlns:ns4="http://www.promostandards.org/WSDL/Invoice/1.0.0/SharedObjects/">{{queryTpe}}
            </ns4:queryType>
            <ns5:requestedDate xmlns:ns5="http://www.promostandards.org/WSDL/Invoice/1.0.0/SharedObjects/">
                {{requestedDate}}
            </ns5:requestedDate>
        </ns0:GetInvoicesRequest>
    </soap-env:Body>
</soap-env:Envelope>
